// Title: DeviceCredentialDeployment.exe Execution
// Desc: Detects the execution of DeviceCredentialDeployment to hide a process from view
// Ref - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/DeviceCredentialDeployment.yml
// MITRE: https://attack.mitre.org/techniques/T1564/ (Defense Evasion)
// Severity: high
// Trigger: DeviceCredentialDeployment
// Usecase: Can be used to stealthily run a console application (e.g. cmd.exe) in the background
// From: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/proc_creation_win_lolbin_device_credential_deployment.yml
// By: Frankie Li
// On: 05-05-2023
DeviceProcessEvents 
| where FolderPath endswith @'\DeviceCredentialDeployment.exe'
| project Timestamp, DeviceName, AccountName, InitiatingProcessParentFileName, FolderPath, ProcessCommandLine
