// Title: Execute MSDT Via Answer File
// Desc: Detects "msdt.exe" (Microsoft diagnostics tool) using an answer file which is simulating the legitimate way of calling msdt via "pcwrun.exe" 
// Ref - https://lolbas-project.github.io/lolbas/Binaries/Msdt/
// Ref - https://oddvar.moe/2017/12/21/applocker-case-study-how-insecure-is-it-really-part-2/
// MITRE: https://attack.mitre.org/techniques/T1218/ (Defense Evasion: System Binary Proxy Execution)
// MITRE: https://attack.mitre.org/techniques/T1202/ (Defense Evasion: Indirect Command Execution)
// Severity: medium
// Trigger: msdt.exe -path C:\WINDOWS\diagnostics\index\PCWDiagnostic.xml -af C:\PCW8E57.xml /skip TRUE
// Usecase: Execute code bypass Application whitelisting
// From: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/proc_creation_win_lolbin_msdt_answer_file.yml
// By: Frankie Li
// On: 15-05-2023
DeviceProcessEvents 
| where ((FolderPath endswith @'\msdt.exe' and ProcessCommandLine contains @'\WINDOWS\diagnostics\index\PCWDiagnostic.xml' 
    and (ProcessCommandLine contains @' -af ' or ProcessCommandLine contains @' /af ')) 
    and not (InitiatingProcessFolderPath endswith @'\pcwrun.exe'))
| project Timestamp, DeviceName, AccountName, InitiatingProcessParentFileName, FolderPath, ProcessCommandLine